app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('This site rocks man!!!', 'Billy Lane', '2012-09-13 22:26:41', 1, '2012-09-13 22:26:41')
---
  def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create(params[:comment])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2
---
    def destroy
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])
      @comment.destroy