app/controllers/posts_controller.rb

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `name`, `postfile_content_type`, `postfile_file_name`, `postfile_file_size`, `postfile_updated_at`, `title`, `updated_at`) VALUES ('Imagine a namespace as a drawer in which you can put all kinds of things: a pencil, a ruler, a piece of paper and so forth. These are your belongings. Directly underneath your drawer is someone else’s, and he puts the same things in it. To avoid using each other’s items, you decide to label the drawers so it’s clear what belongs to whom.\r\n\r\nPreviously, developers had to use underscores in their classes, functions and constants to separate code bases. That’s equivalent to labeling each others belongings and putting them in one big drawer. Sure, it’s at least some kind of organization, but it’s very inefficient.\r\n\r\nNamespacing to the rescue! You can declare the same function, class, interface and constant definitions in separate namespaces without receiving fatal errors. Essentialy, a namespace is nothing more than a hierarchically labeled code block holding regular PHP code.', '2012-10-05 17:35:20', 'Tamer Elhotiby', NULL, NULL, NULL, NULL, 'Namespacing in PHP', '2012-10-05 17:35:20')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `postfile_file_name` = 'oldpic.png', `postfile_content_type` = 'image/png', `postfile_file_size` = 552632, `postfile_updated_at` = '2012-10-05 19:21:07', `updated_at` = '2012-10-05 19:21:07' WHERE `posts`.`id` = 3